rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def search_by_director
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id)